In [1]:
import pandas as pd

# Customers

In [10]:
df_cust = pd.read_csv('../input/customers.csv', parse_dates=['data_nascimento', 'data_cadastro'])
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      12000 non-null  object
 1   nome             12000 non-null  object
 2   data_nascimento  12000 non-null  datetime64[ns]
 3   renda_mensal     12000 non-null  float64
 4   score_interno    12000 non-null  int64
 5   estado           12000 non-null  object
 6   data_cadastro    12000 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 656.4+ KB

In [11]:
df_cust.head()

,customer_id,nome,data_nascimento,renda_mensal,score_interno,estado,data_cadastro
0,C100000,Cliente 0,1980-01-13,1859.70,807,PR,2023-07-07
1,C100001,Cliente 1,2006-01-06,4818.29,623,PR,2025-05-11
2,C100002,Cliente 2,1988-01-11,1644.88,551,PB,2022-01-21
3,C100003,Cliente 3,1982-01-12,6885.32,649,RN,2023-06-07
4,C100004,Cliente 4,1987-01-11,7513.20,611,AC,2025-08-01

In [12]:
df_cust.tail()

,customer_id,nome,data_nascimento,renda_mensal,score_interno,estado,data_cadastro
11995,C111995,Cliente 11995,1986-01-11,6686.11,773,PA,2025-09-05
11996,C111996,Cliente 11996,1985-01-11,5298.27,398,PI,2023-03-17
11997,C111997,Cliente 11997,1983-01-12,3486.73,784,SC,2021-05-08
11998,C111998,Cliente 11998,1987-01-11,2721.03,629,PA,2025-02-19
11999,C111999,Cliente 11999,1996-01-09,20228.17,649,RN,2023-07-31

In [23]:
df_cust['customer_id'].unique()

array(['C100000', 'C100001', 'C100002', ..., 'C111997', 'C111998',
       'C111999'], shape=(12000,), dtype=object)

In [24]:
df_cust['nome'].unique()

array(['Cliente 0', 'Cliente 1', 'Cliente 2', ..., 'Cliente 11997',
       'Cliente 11998', 'Cliente 11999'], shape=(12000,), dtype=object)

In [27]:
df_cust['data_nascimento'].isna().sum()

np.int64(0)

In [28]:
df_cust['renda_mensal'].describe()

count    12000.000000
mean      4193.414297
std       2761.384443
min       1200.000000
25%       2339.507500
50%       3492.860000
75%       5212.307500
max      30000.000000
Name: renda_mensal, dtype: float64

In [29]:
df_cust['score_interno'].describe()

count    12000.000000
mean       649.353333
std        203.162394
min        300.000000
25%        473.000000
50%        649.000000
75%        825.000000
max       1000.000000
Name: score_interno, dtype: float64

In [30]:
df_cust['estado'].value_counts()

estado
PI    487
PA    484
RJ    472
MG    469
AP    464
ES    463
DF    461
GO    460
TO    457
CE    454
MT    451
MS    450
RN    447
MA    445
SE    441
SP    440
RS    440
AC    438
RO    435
BA    433
PR    427
SC    422
AL    420
AM    418
RR    414
PE    411
PB    397
Name: count, dtype: int64

In [31]:
df_cust['data_cadastro'].isna().sum()

np.int64(0)

# Loans

In [44]:
df_loans = pd.read_csv('../input/loans.csv', dtype={'prazo_meses': int}, parse_dates=['data_concessao', 'prazo_meses'])
df_loans['prazo_meses'] = df_loans['prazo_meses'].str.strip().astype(int)
df_loans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   loan_id           20000 non-null  object
 1   customer_id       20000 non-null  object
 2   data_concessao    20000 non-null  datetime64[ns]
 3   valor_contratado  20000 non-null  float64
 4   prazo_meses       20000 non-null  int64
 5   taxa_juros_anual  20000 non-null  float64
 6   canal             20000 non-null  object
 7   status            20000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 1.2+ MB

C:\Users\Armando\AppData\Local\Temp\ipykernel_23060\2555989741.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_loans = pd.read_csv('../input/loans.csv', dtype={'prazo_meses': int}, parse_dates=['data_concessao', 'prazo_meses'])

In [45]:
df_loans.head()

,loan_id,customer_id,data_concessao,valor_contratado,prazo_meses,taxa_juros_anual,canal,status
0,L200000,C108550,2024-09-07,5277.54,21,0.20,web,ativo
1,L200001,C100625,2022-10-08,5575.76,16,0.20,app,inadimplente
2,L200002,C108918,2023-01-13,1839.89,28,0.50,app,inadimplente
3,L200003,C102354,2021-07-21,3719.18,16,0.50,app,liquidado
4,L200004,C104442,2024-07-25,5337.21,17,0.28,app,ativo

In [46]:
df_loans.tail()

,loan_id,customer_id,data_concessao,valor_contratado,prazo_meses,taxa_juros_anual,canal,status
19995,L219995,C104855,2022-09-08,9117.31,15,0.50,loja,inadimplente
19996,L219996,C109725,2024-03-29,8447.63,20,0.36,web,inadimplente
19997,L219997,C111836,2022-04-22,5178.72,33,0.50,app,inadimplente
19998,L219998,C111048,2021-07-24,4920.76,14,0.28,web,liquidado
19999,L219999,C102589,2024-11-30,892.59,24,0.50,app,inadimplente

In [47]:
df_loans['loan_id'].unique()

array(['L200000', 'L200001', 'L200002', ..., 'L219997', 'L219998',
       'L219999'], shape=(20000,), dtype=object)

In [48]:
df_loans['customer_id'].unique()

array(['C108550', 'C100625', 'C108918', ..., 'C101176', 'C102819',
       'C102589'], shape=(9776,), dtype=object)

In [49]:
df_loans['data_concessao'].isna().sum()

np.int64(0)

In [50]:
df_loans['valor_contratado'].describe()

count    20000.000000
mean      5036.399266
std       2404.251296
min        800.000000
25%       3307.295000
50%       4991.570000
75%       6663.652500
max      14579.480000
Name: valor_contratado, dtype: float64

In [55]:
df_loans['prazo_meses'].describe()

count    20000.000000
mean        20.877200
std          8.913035
min          6.000000
25%         13.000000
50%         21.000000
75%         29.000000
max         36.000000
Name: prazo_meses, dtype: float64

In [56]:
df_loans['taxa_juros_anual'].describe()

count    20000.000000
mean         0.338509
std          0.117766
min          0.200000
25%          0.200000
50%          0.360000
75%          0.500000
max          0.500000
Name: taxa_juros_anual, dtype: float64

In [57]:
df_loans['canal'].value_counts()

canal
app         10045
web          4925
parceiro     4008
loja         1022
Name: count, dtype: int64

In [58]:
df_loans['status'].value_counts()

status
inadimplente    15405
ativo            2956
liquidado        1639
Name: count, dtype: int64

# Payments

In [52]:
df_pay = pd.read_csv('../input/payments.csv', parse_dates=['data_vencimento', 'data_pagamento'])
df_pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 328195 entries, 0 to 328194
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   payment_id       328195 non-null  object
 1   loan_id          328195 non-null  object
 2   data_vencimento  328195 non-null  datetime64[ns]
 3   data_pagamento   99462 non-null   datetime64[ns]
 4   valor_parcela    328195 non-null  float64
 5   valor_pago       328195 non-null  float64
 6   atraso_dias      99462 non-null   float64
dtypes: datetime64[ns](2), float64(3), object(2)
memory usage: 17.5+ MB

In [53]:
df_pay.head()

,payment_id,loan_id,data_vencimento,data_pagamento,valor_parcela,valor_pago,atraso_dias
0,a40a8982-f1a,L200000,2024-10-07,2024-10-07,299.92,299.92,0.0
1,bf5538d9-05f,L200000,2024-11-06,2024-11-06,299.92,299.92,0.0
2,7e60d248-0c3,L200000,2024-12-06,2024-12-06,299.92,299.92,0.0
3,8b407420-8c3,L200000,2025-01-05,2025-01-08,299.92,299.92,3.0
4,aa85c506-eb6,L200000,2025-02-04,2025-02-06,299.92,299.92,2.0

In [54]:
df_pay.tail()

,payment_id,loan_id,data_vencimento,data_pagamento,valor_parcela,valor_pago,atraso_dias
328190,ce3b1db6-8c2,L219999,2025-05-29,NaT,59.55,0.0,NaN
328191,784f13b1-9ef,L219999,2025-06-28,NaT,59.55,0.0,NaN
328192,c7093e95-a75,L219999,2025-07-28,NaT,59.55,0.0,NaN
328193,53c72af5-4a5,L219999,2025-08-27,NaT,59.55,0.0,NaN
328194,6fa92eb4-667,L219999,2025-09-26,NaT,59.55,0.0,NaN

In [59]:
df_pay['payment_id'].unique()

array(['a40a8982-f1a', 'bf5538d9-05f', '7e60d248-0c3', ...,
       'c7093e95-a75', '53c72af5-4a5', '6fa92eb4-667'],
      shape=(328195,), dtype=object)

In [60]:
df_pay['loan_id'].unique()

array(['L200000', 'L200001', 'L200002', ..., 'L219997', 'L219998',
       'L219999'], shape=(19825,), dtype=object)

In [61]:
df_pay['data_vencimento'].isna().sum()

np.int64(0)

In [62]:
df_pay['data_pagamento'].isna().sum()

np.int64(228733)

In [63]:
df_pay['valor_parcela'].describe()

count    328195.000000
mean        333.750925
std         220.678603
min          29.730000
25%         188.500000
50%         294.050000
75%         424.280000
max        2479.220000
Name: valor_parcela, dtype: float64

In [64]:
df_pay['valor_pago'].describe()

count    328195.000000
mean        105.754693
std         210.712041
min           0.000000
25%           0.000000
50%           0.000000
75%         145.280000
max        2479.220000
Name: valor_pago, dtype: float64

In [65]:
df_pay['atraso_dias'].describe()

count    99462.000000
mean         3.031711
std          8.794268
min          0.000000
25%          0.000000
50%          1.000000
75%          2.000000
max         54.000000
Name: atraso_dias, dtype: float64